import Vue from 'vue'

export default function() {
  // emoji转图片
  Vue.component('emoji-comment', {
    functional: true,
    props: { comment: String },
    render: function (createElement, context) {
      let e = context.props.comment
      if (e) {
        // 简繁体
        var t = !(!window.lang || "zh-hant" != window.lang);
        e = e.replace(/href= target='_blank'/gi, 'href="javascript:;"');
        var n = t ? ["微笑", "大笑", "鼓掌", "為什么", "哭", "怒", "滴汗", "俏皮", "傲", "好困惑", "興奮", "加油", "困頓", "想一下", "撇嘴", "色", "發呆", "得意", "害羞羞", "大哭", "呲牙", "驚訝", "囧", "抓狂", "偷笑", "愉快", "憨笑", "暈", "再見", "壞笑", "左哼哼", "右哼哼", "哈欠", "委屈", "快哭了", "親", "可憐", "口罩", "笑哭", "驚嚇", "哼", "捂臉", "奸笑", "吃瓜", "旺柴", "圍觀", "攤手", "愛心", "獻花", "福", "拜神", "勝利", "贊", "握手", "抱拳", "勾引", "拳頭", "OKOK", "強壯", "毛估估", "虧大了", "賺大了", "牛", " ", "成交", "財力", "護城河", "復盤", "買入", "賣出", "滿倉", "空倉", "抄底", "看多", "看空", "加倉", "減倉", "上漲", "下跌", "財神", "火箭", "龍頭", "韭菜", "面", "泡沫", "慘!關燈吃面", "666", "嘆氣", "讓我看看", "發財", "主力", "梭哈", "國家隊", "中簽", "幹杯"] : ["微笑", "大笑", "鼓掌", "为什么", "哭", "怒", "滴汗", "俏皮", "傲", "好困惑", "兴奋", "加油", "困顿", "想一下", "撇嘴", "色", "发呆", "得意", "害羞羞", "大哭", "呲牙", "惊讶", "囧", "抓狂", "偷笑", "愉快", "憨笑", "晕", "再见", "坏笑", "左哼哼", "右哼哼", "哈欠", "委屈", "快哭了", "亲", "可怜", "口罩", "笑哭", "惊吓", "哼", "捂脸", "奸笑", "吃瓜", "旺柴", "围观", "摊手", "爱心", "献花", "福", "拜神", "胜利", "赞", "握手", "抱拳", "勾引", "拳头", "OKOK", "强壮", "毛估估", "亏大了", "赚大了", "牛", " ", "成交", "财力", "护城河", "复盘", "买入", "卖出", "满仓", "空仓", "抄底", "看多", "看空", "加仓", "减仓", "上涨", "下跌", "财神", "火箭", "龙头", "韭菜", "面", "泡沫", "惨!关灯吃面", "666", "叹气", "让我看看", "发财", "主力", "梭哈", "国家队", "中签", "干杯"]
          , r = new RegExp("\\[.+?\\]","ig");
        // emoji转图片
        e = e.replace(r, function(e) {
            for (var t = 0; t < n.length; t++) {
              if ("[" + n[t] + "]" == e) return `$^${t+1}.png$^`
            }
            return e
        })
      }
      // 合并
      return createElement('span', e.split('$^').map(t => /^\d+\.png$/.test(t)? createElement('img',{
        attrs:{src:`//gbfek.dfcfw.com/face/emot_default/emot${t}`},
        class: {emot:true}
      }):t))
    }
  })
}